Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags
The end-detail strip flags enum.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.Shape
The shape flag

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.Angle
The angle flag.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.Radius
The radius flag.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.Length
The length flag.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.ThreadingType
The threading type.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.ThreadingLength
The threading length.

Tekla.Structures.ModelInternal.RebarEndDetailStrip.EndDetailStripFlags.ThreadingExtraFabLength
The threading extra fab length.